// — Написати програму яка видає користувачу ввести число. 
//Після введення числа вистрибує алерт з оголошенням пори року
// до якої відноситься число (номер місяця) що ввів користувач. Якщо число не входить в діапазон від 1 до 12 тоді неможливо.

const numb = prompt('введіть число від 1 до 12');
const calendar = ['Січень', 'Лютий', 'Березень', 'Квітень', 'Травень', 'Червень', 'Липень', 'Серпень', 'Вересень', 'Жовтень', 'Листопад', 'Грудень'];
if (numb <= 12) {
    const result = calendar[numb - 1];
    alert(result);
}
else {
    alert('під таким номером такого місяця не ма');
}